In [1]:
import pandas as pd

In [3]:
df_movie_rating = pd.DataFrame({'movie1':[5,4,3,3,2,1],'movie2':[4,5,2,3,4,2]},
                               index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [4]:
df_movie_rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

In [5]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    
    if rating==4:
        return 'B'
    if rating ==3:
        return 'C'
    else:
        return 'F'

In [6]:
print(movie_grade(5))

A

In [8]:
df_movie_rating.applymap(movie_grade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      F
Ram        C      C
Ted        F      B
Paul       F      F

Data operations with statistical functions

In [20]:
df_test_scores = pd.DataFrame(
    {'test1':[56,45,34,38,27,15],
     'test2':[47,55,28,39,44,23]},
    index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [22]:
df_test_scores

       test1  test2
Tom       56     47
Jeff      45     55
Peter     34     28
Ram       38     39
Ted       27     44
Paul      15     23

In [21]:
df_test_scores.max()

test1    56
test2    55
dtype: int64

In [23]:
df_test_scores.mean()

test1    35.833333
test2    39.333333
dtype: float64

In [24]:
df_test_scores.std()

test1    14.218533
test2    12.011106
dtype: float64

Data operation using GroupBy

In [25]:
df_president_names = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                               'last':['Bush','Clinton','Regan','Carter','Washington']})

In [26]:
df_president_names

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [29]:
grouped = df_president_names.groupby('first')

In [30]:
grouped_data = grouped.get_group('George')
grouped_data

    first        last
0  George        Bush
4  George  Washington

In [31]:
df_president_names.sort_values("first")

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [32]:
def standardize_tests(test):
    return(test-test.mean())/ test.std()

In [35]:
standardize_tests(df_test_scores['test1'])

Tom      1.418337
Jeff     0.644699
Peter   -0.128940
Ram      0.152383
Ted     -0.621255
Paul    -1.465224
Name: test1, dtype: float64

Data Standardization - Analysing the dataset and catching outliers

In [36]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [37]:
standardize_test_scores(df_test_scores)

          test1     test2
Tom    1.418337  0.638298
Jeff   0.644699  1.304348
Peter -0.128940 -0.943571
Ram    0.152383 -0.027752
Ted   -0.621255  0.388529
Paul  -1.465224 -1.359853

more operations = merge , Duplicate,Concatenate

In [38]:
import pandas as pd

In [46]:
df_student_math = pd.DataFrame({'student':['Tom','Jack','den','Ram','David','Jaff'],'id':[10,56,31,85,9,22]})

In [47]:
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],'id':[10,12,22]})

In [48]:
pd.merge(df_student_math,df_student_science)

  student  id
0     Tom  10

In [49]:
pd.merge(df_student_math,df_student_science,on='student')

  student  id_x  id_y
0     Tom    10    10
1     Ram    85    12
2   David     9    22

In [59]:
pd.merge(df_student_math,df_student_science,on='id',how='left').fillna('x')

  student_x  id student_y
0       Tom  10       Tom
1      Jack  56         x
2       den  31         x
3       Ram  85         x
4     David   9         x
5      Jaff  22     David

In [57]:
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  id
0     Tom  10
1    Jack  56
2     den  31
3     Ram  85
4   David   9
5    Jaff  22
6     Tom  10
7     Ram  12
8   David  22

In [65]:
df_survey_student_data=pd.DataFrame({'student':['tom','David','Ram','Jack','tom','den'],'id':[10,9,85,56,10,31]})

In [66]:
df_survey_student_data

  student  id
0     tom  10
1   David   9
2     Ram  85
3    Jack  56
4     tom  10
5     den  31

In [67]:
df_survey_student_data.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [69]:
df_survey_student_data.drop_duplicates('id')

  student  id
0     tom  10
1   David   9
2     Ram  85
3    Jack  56
5     den  31